Тернарный оператор
Оператор ?: выполняет Выражение-1 если условие Истинно, иначе выполняет
Выражение-2.
В общем виде записывается следующим образом:
Условие ? Выражение-1 : Выражение-2
Подсказка: как запомнить правила вычисления тернарного оператора:
Это условие истинно ? да : нет

Задача 1. Сумматор
Напишите программу, которая запрашивает у пользователя целые числа до тех пор, пока пользователь не введёт число 0.

После того, как пользователь ввёл число 0, программа выводит сумму введённых пользователем чисел и завершает работу.
#include <iostream>

int main() {
  int num, sum = 0;
  
  do{
    std::cout << "Введите целое число или число '0', чтобы закончить:\n";
    std::cin >> num;
    sum += num;
  } while (num != 0);
  std::cout <<"Сумма: " << sum;
  return 0;
}
Задача 2. Сумма цифр числа
Описание
Напишите программу, которая запрашивает у пользователя целое число и выводит на экран сумму всех его цифр.
#include <iostream>

int main() {
  int num, sum = 0;

  std::cout << "Введите целое число:\n";
  std::cin >> num;
  
  while (num != 0) {
    sum += num % 10;
    num = num / 10;
  }
  std::cout << "Сумма цифр: " << sum;
  return 0;
}

Сортировка пузырком

for(int j = 0; j< size; j++){
  for(int i = o; i < size -1; i++){
    if (data[i]>data[i+1]){
      std::swap(data[i], data[i+1]);
    }
  }
}