								

Задание 2. Упорядочить числа
Напишите программу, которая запрашивает у пользователя три целых числа и выводит их на экран в порядке убывания.

Пример
Введите первое число: 1
Введите второе число: -2
Введите третье число: 3

Результат: 3 1 -2

#include <iostream>

int main() {
  int num_1, num_2, num_3;

  std::cout << "Введите первое число: ";
  std::cin >> num_1;
  std::cout << "Введите второе число: ";
  std::cin >> num_2;
  std::cout << "Введите третье число: ";
  std::cin >> num_3;

  std::cout << "\nNumber " << (num_1 > num_2 ?(num_1 > num_3 ? num_1 : num_3) : (num_2 > num_3 ? num_2 : num_3));

  std::cout << " " << (num_1 > num_2 ?(num_1 < num_3 ? num_1 : (num_2 > num_3 ? num_2 : num_3)) : (num_1 < num_3 ? (num_3 > num_2 ? num_2 : num_3) : num_1));//Это был ужас, но я его решить.

  std::cout << " " << (num_1 < num_2 ?(num_1 < num_3 ? num_1 : num_3) : (num_2 < num_3 ? num_2 : num_3));

  return 0;
}


Задание 3*. Гороскоп
Пользователь вводит информацию о себе:

пол;
знак зодиака;
возраст.
Результат работы программы – предсказание.

#include <iostream>

int main() {
  int age;
  std::string sign, sex;

  std::cout << "Введите пол: ";
  std::cin >> sex;

  std::cout << "Введите знак зодиака: ";
  std::cin >> sign;

  std::cout << "Введите возраст: ";
  std::cin >> age;

  std::cout<< "Ваше предсказание:"<< std::endl;

  if ((sex == "м" || sex == "мужчина" || sex == "мужской") && (sign == "рак" || sign == "скорпион" || sign == "рыбы") && (age < 40 && age > 0)) {
     std::cout << "Сегодня очень плодотворный день. Можно добиться того, что прежде казалось почти невозможным.";
  }else if((sex == "ж" || sex == "женщина" || sex == "женский") && (sign == "телец" || sign == "дева" || sign == "козерог") && (age >= 15 && age <= 30)){
    std::cout << "Сегодняшний вечер подходит для общения с друзьями, проведения домашних праздников и импровизированных вечеринок. Будет не только весело, но и интересно: найдется дело, которое увлечет всех.";
  }else{
    std::cout << "Гороскоп для вас находится в разработке. Приходите чуточку позже ;)";
  }

  return 0;
}
// Если при вводе в консоль вы допускаете ошибку и стираете чтобы написать заново или просто поправить, програма выдаст else. Я думаю что это связанно с тем что консоль считывает Backspace как знак и добовляет его к переменной. Правильно? Если нет тогда почему?


Задание 4*. Сравнить числа
Напишите программу, которая запрашивает у пользователя два целых числа меньше 100 и выводит на экран результат их сравнения в текстовом виде.

#include <iostream>


std::string numberToText(int number){
  std::string words_rus[] = {"Ноль","Один","Два","Три","Четыре","Пять","Шесть","Семь","Восемь","Девять","Десять","Одиннадцать","Двенадцать","Тринадцать","Четырнадцать","Пятнадцать","Шестнадцать","Семнадцать","Восемнадцать","Девятнадцать","Двадцать","Тридцать","Сорок","Пятьдесят","Шестьдесят","Семьдесят","Восемьдесят","Девяносто"};//Я использовал ИИ чтобы написать все эти цифры словами поэтому они с большой буквы.

  if(number >= -99 && number <= 99){
    if(number < 0){
      return "минус " + numberToText(-number);// Эту строку мне подсказал знакомый. Здесь мы запускаем Loop в котором заходим в функцию еще раз только теперь цифра положительная.
    }else if(number <= 20){
      return words_rus[number];
    }else{
    int tens = number / 10;
    int ones = number % 10;
    return words_rus[tens +18] + (ones ? " " + words_rus[ones] : "");//Здесь мы прибавляем 18 чобы найти нужное положение в массиве. Так как массив начинается с нуля мы добавляем 18 чтобы получить нужное число.
    }
  }else{
    return "Error!";//Эта строка необезательна так как в теории мы никогда не должны сюда попасть но для удобства добавил.
  }
}// Самму идею я нашел в интернете, там был другой пример но я импользовал эго логику потому что не смог найти другого способа. Вцелом как я понял, без доп знаний эту задачу не возможно сделать ведь я использовал знания которые получил при изучении С. Если есть другой способ и я его упустил покажите мне его пожалуйста.
//РS Извините за граматические ошибки. На моей клавиатуре нет русских букв и я пишу по памяти.

int main() {
  int num_1, num_2;
  

  std::cout << "Введите целое число: ";
  std::cin >> num_1;

  std::cout << "Введите целое число: ";
  std::cin >> num_2;
  std::cout << std::endl;

  
  if(num_1 >= 100 || num_1 <= -100 || num_2 >= 100 || num_2 <= -100){
    std::cout << "\nОшибка! Одно из чисел вне диапазона!";
  }else{
    if(num_1 > num_2){
      std::cout << numberToText(num_1) << " больше чем " << numberToText(num_2);
    }else if(num_1 == num_2){
      std::cout << numberToText(num_1) << " равно " << numberToText(num_2);
    }else{
      std::cout << numberToText(num_1) << " меньше чем " << numberToText(num_2);
    }
  }
  return 0;
}